[{
  "shorttitle": "Advertising Positions",
  "thumb": "img/ap_s.jpg",
  "shortdesc": "These works begin with robots; software robots trained to search the web, according to specific user profiles they have been assigned, including age, gender, location, interests and the like...",
  "longtitle": "Advertising Positions",
  "image": "img/ap_l.jpg",
  "longdesc": "These works begin with robots; software robots trained to search the web, according to specific user profiles they have been assigned, including age, gender, location, interests and the like. Each robot is released on the web, driving a modified version of Google’s Chrome browser, to periodically visit sites that it 'likes', and to click links that it selects, which then bring it to new sites. This process continues over several weeks, during which the robot collects, as it has been trained to do, all of the advertisements it is served based on its profile (generally several thousand or more), applying each to a single polygon on the mesh skin of the virtual avatar it inhabits. The training period concludes when the robot’s 3-dimensional figure is complete.",
  "links": [{
    "name": "Project Home Page",
    "target": "adverpos/"
  }]
}, {
  "shorttitle": "AdNauseam",
  "thumb": "img/adn_s.png",
  "shortdesc": "AdNauseam is a free browser addon that attempts to simultaneously protect users from tracking by advertising networks and to subvert the economic system that drives it.",
  "collaborators": "NISSENBAUM & ZER-AVIV",
  "longtitle": "AdNauseam",
  "image": "img/adn_l.jpg",
  "longdesc": "AdNauseam (ADN) is one of several recent projects focusing on the browser as a site for artistic intervention. Like an ad-blocker, ADN hides ads on visited pages, but then clicks each ad in the background, polluting user profiles and creating mistrust between advertisers and the networks they pay for clicks. <br><br />Further, by allowing users to explore visualizations of the ads they are served, ADN creates a space for 'sousveillance', providing an algorithmic glimpse into the profiles taken and stored without our consent. The project was recently presented at Eyebeam, MIT, and the New School, covered by Wired magazine, and featured at Transmediale in Berlin. <br><br />AdNauseam developed from an earlier project entitled TrackMeNot, which similarly protected users from data profiling by issuing generated decoy queries to search engines. Users' real searches are hidden in a cloud of false data (see links below). ",
  "links": [
    {
      "name": "Project Home Page (& video)",
      "target": "https://adnauseam.io"
    }, {
      "name": "Interview: Canadian Public Radio",
      "target": "../spark/"
    }, {
      "name": "Talk at HopeX 2014 (video)",
      "target": "https://www.youtube.com/watch?v=Po593tV-vAg"
    }, {
      "name": "The AdNauseam/Obfuscation Paper",
      "target": "http://www.aprja.net/?p=2510"
    }, {
      "name": "The Precursor (TrackMeNot)",
      "target": "http://cs.nyu.edu/trackmenot/"
    }, {
      "name": "The TrackMeNot Paper",
      "target": "http://cs.nyu.edu/trackmenot/TMN-Howe-Niss08-ch23.pdf"
    }
  ]
}, {
  "shorttitle": "How It Is...",
  "thumb": "img/hiiict_s.jpg",
  "shortdesc": "How It Is in Common Tongues (HIIiCT)  is a conceptual novel and algorithmic provocation against the overreaches of copyright, composed by searching for the text of Samuel Beckett's How It Is in Google Books...",
  "collaborators": "John Cayley",
  "longtitle": "How It Is in Common Tongues",
  "image": "img/hiiict_l.jpg",
  "longdesc": "How It Is in Common Tongues is a conceptual novel and provocation against copyright composed by searching for the text of Samuel Beckett's How It Is in Google Books, attempting to find, in sequence, the longest common phrases from the work composed by writers other than Beckett. Each phrase is then cited with a footnote providing the shortest URL found for the phrase (in addition to the date and the total number of occurrences found). The result is a word-for-word remake of the original Beckett text, with every single phrase cited with its location in the largest linguistic commons in human history, as written by someone else.<br><br>How It Is in Common Tongues is one output of the Readers Project(see below). This long-term project, in collaboration with John Cayley, is an aesthetically-oriented system of software entities that autonomously explore the culture of human reading in the face of ubiquitous networked services.",
  "links": [
    {
      "name": "The Readers Project (parent project)",
      "target": "http://thereadersproject.org"
    }, {
      "name": "Project Paper (in <i>Leonardo</i>)",
      "target": "http://rednoise.org/~dhowe/pubs/LEON4404_pp317-324.pdf"
    }, {
      "name": "The Write-up on UBUWeb",
      "target": "http://www.ubuweb.com/contemp/cayley/"
    }, {
      "name": "Full.pdf of the Work",
      "target": "http://rednoise.org/readers/hiiict.pdf"
    }, {
      "name": "On the Radical Books List",
      "target": "http://nickm.com/post/2013/01/radical-books-of-2012-2/"
    }, {
      "name": "For Sale on Amazon",
      "target": "http://www.amazon.com/How-Common-Tongues-Readers-Project/dp/094845430X"
    }
  ]
}, {
  "shorttitle": "The Readers Project",
  "thumb": "img/reader_s.jpg",
  "shortdesc": "The Readers Project is an aesthetically-oriented system of software entities designed to explore the culture of human reading in the face of ubiquitous algorithmic & networked services.",
  "collaborators": "John Cayley",
  "longtitle": "The Readers Project",
  "image": "img/reader_l.jpg",
  "longdesc": "The Readers Project (an ongoing collaboration with John Cayley) is an aesthetically-oriented system of software entities that explores the culture of human reading and writing in the face of ubiquitous networked services. The ‘readers’ we create navigate texts according to strategies they derive from linguistic feature analysis and real-time probability data they harvest from search engines. Installations from the project have been featured and commissioned at a number of international venues, and papers have been published in peer-reviewed journals including Leonardo, Siggraph and ISEA. <br><br />A conceptual novel derived from the project, entitled <i>How It Is in Common Tongues</i>, presents a computational critique of copyright and the shrinking of the linguistic commons. The most recent installation of The Readers Project, <i>The Real Story of Ah-Q</i>, premiered in October at ‘Connecting Spaces HK-Zurich’ and critically examined the role of language, narrative, and censorship in the context of contemporary China.",
  "links": [{
    "name": "The Real Story of Ah-Q",
    "target": "http://thereadersproject.org/index.php?p=installation/HK2014/wmc.html"
  }, {
    "name": "The Readers Project Web",
    "target": "http://thereadersproject.org"
  }, {
    "name": "Readers Project Paper (in <i>Leonardo</i>)",
    "target": "http://rednoise.org/~dhowe/pubs/LEON4404_pp317-324.pdf"
  }, {
    "name": "Readers Project Paper II",
    "target": "http://rednoise.org/daniel/pubs/the_readers_project-reading_writing_resisting-howe_cayley.pdf"
  }]
}, {
  "shorttitle": "Automatype",
  "thumb": "img/auto_s.jpg",
  "shortdesc": "Automatype is a a networked installation that uses algorithms to find the bridges between English words, Six-Degrees-of-Kevin-Bacon-style — not bridges of garbled nonsense but composed of normative English. ",
  "longtitle": "Automatype",
  "image": "img/auto_l.jpg",
  "longdesc": "Automatype is a networked installation (composed of analog TV monitors and RaspberryPIs running custom software) that explores the creation of aesthetic, linguistic meaning via anticipation, juxtaposition, and association. Using natural language algorithms (specifically the 'Min-Edit Distance' algorithm), the piece runs continuously, deriving a near infinite number of combinations of words and phrase, letter-by-letter, substitution-by-substitution. <br><br />The project is built with RiTa, my software toolkit for algorithmic creative writing. Combining natural language processing, computational stylistics, and data visualization techniques, the open-source RiTa project provides state-of-the-art natural language techniques to creative writers and language artists.",
  "links": [{
    "name": "The Project Website (& video)",
    "target": "http://rednoise.org/~dhowe/automatype/"
  }, {
    "name": "A review at SFMOMA",
    "target": "http://openspace.sfmoma.org/2011/09/third-hand-plays-automatype-by-daniel-c-howe/"
  }, {
    "name": "Review by Leonardo Flores",
    "target": "http://iloveepoetry.com/?p=360"
  }, {
    "name": "Review by Barbara Bordalej",
    "target": "http://iloveepoetry.com/?p=5865"
  }, {
    "name": "Featured in NT2 (French)",
    "target": "http://nt2.uqam.ca/repertoire/automatype"
  }, {
    "name": "The RiTa paper (with A.B. Soderman)",
    "target": "http://hyperrhiz.net/hyperrhiz06/essays/the-aesthetics-of-generative-literature-lessons-from-a-digital-writing-workshop.html"
  }, {
    "name": "The RiTa HomePage",
    "target": "http://rednoise.org/rita/"
  }]
}, {
  "shorttitle": "Minor Distance",
  "thumb": "img/md_s.jpg",
  "shortdesc": "Minor Distance is a musical collaboration between Seaman and Howe that came about after the pair exchanged ideas and recordings while travelling separately.",
  "collaborators": "Bill Seaman",
  "longtitle": "Minor Distance",
  "image": "img/md_l.jpg",
  "longdesc": "Minor Distance (Cotton Goods Records) is a collaboration between Howe and Bill Seaman realized after the two exchanged ideas while both travelling separately—in effect making for an album recorded between Seoul, Bremen, Frankfurt, Berlin, Thailand, China and New York—covering more than the &quot;Minor Distance&quot; referred to in the title. The recordings began with Howe's improvised guitar recordings, played live-to-tape through his own custom software, and Seaman's simple piano loops... <br><br />'[T]he uncanny ability of this recording to evoke snatches of work well removed from the genre: Miles floating a single trumpet note toward the ceiling of that deconsecrated Armenium church in &quot;So What&quot;. The way that the piano appears out of the rain on those divine Blue Nile recordings. The grave and resolute brass in Johan Johanssen's &quot;Miner's Hymns&quot;. Moments of beauty that leap the gap like a spark across the air... I will keep these recordings near to hand.'  -Gregory Taylor <br><br />'Howe's noise-meets-Ry-Cooder electric guitar fills gravitate like a swarm of metallic dragon flies...' -Steve Fore ",
  "links": [
    {
      "name": "Listen...",
      "target": "http://rednoise.org/minordistance/tracks.html"
    }, {
      "name": "Cotton Goods Home Page",
      "target": "http://minor-distance.tumblr.com/"
    }, {
      "name": "http://minor-distance.tumblr.com/press/",
      "target": "Reviews and Press links"
    }, {
      "name": "Special Edition Release",
      "target": "http://boomkat.com/cds/1025855-howe-seaman-minor-distance-special-edition"
    }
  ]
}, {
  "shorttitle": "RiTa",
  "thumb": "img/RiTa_s.png",
  "shortdesc": "Designed to support the creation of novel works of generative literature, the RiTa library (for Java, JavaScript, and NodeJS) provides a unique set of tools for artists and writers working in programmable media. ",
  "longtitle": "RiTa",
  "image": "img/ritapen.jpg",
  "longdesc": "Designed to support the creation of novel works of generative literature, the RiTa library (for Java, JavaScript, and NodeJS) provides a unique set of tools for artists and writers working in programmable media. RiTa is designed to be easy-to-use while still enabling a range of tasks, from grammar and Markov-based generation to text-mining, text-to-speech, & animation. RiTa, implemented in both Java and JavaScript, is free and open-source, and optionally runs in the popular 'Processing' environment for arts programming.",
  "links": [
    {
      "name": "The RiTa paper (with A.B. Soderman)",
      "target": "http://hyperrhiz.net/hyperrhiz06/essays/the-aesthetics-of-generative-literature-lessons-from-a-digital-writing-workshop.html"
    }, {
      "name": "The RiTa HomePage",
      "target": "http://rednoise.org/rita/"
    }
  ]
}, {
  "shorttitle": "text.curtain",
  "thumb": "img/textcurtain_s.jpg",
  "shortdesc": "text.curtain explores relationships between poetic text and ludic play via an interactive recombinant text. Projected on a wall-size screen, text.curtain presents a physics-based interface that organically responds to the interactions of multiple simultaneous users. ",
  "longtitle": "text.curtain",
  "image": "img/textcurtain_l.png",
  "longdesc": "text.curtain explores relationships between poetic text and ludic play via an interactive recombinant text. Projected on a wall-size screen, text.curtain presents a physics-based interface that organically responds to the interactions of multiple simultaneous users. As the piece is disrupted and letters wash back and forth, a granular synthesis engine provides realtime aural feedback. Tension is created through the simultaneous desire of users to both disrupt the existing text via 'play' and to ‘read’ the piece as it evolves and recombines in response."
}, {
  "shorttitle": "TrackMeNot",
  "thumb": "img/tmn_s.jpg",
  "shortdesc": "TrackMeNot blends software tool and 'artware' intervention in a browser extension designed to protect users from surreptitious data profiling and to interpose in the power dynamic between searchers & the corporations controlling our data.",
  "collaborators": "Helen Nissenbaum",
  "longtitle": "TrackMeNot",
  "image": "img/tmn_l.jpg",
  "longdesc": "TrackMeNot blends software tool and 'artware' intervention in a browser extension designed to protect users from surreptitious data profiling and to interpose in the power dynamic between searchers & the corporations controlling our data. Unlike most privacy tools, TMN works not by means of concealment or encryption, but via noise and obfuscation. Running as a background process, TMN periodically issues algorithmically-generated decoy queries to search engines like Google, Yahoo & Bing. Users' real searches, lost in a cloud of false data, are hidden in plain view."
}, {
  "shorttitle": "Architecture of Association",
  "thumb": "img/aoa_s.jpg",
  "shortdesc": "The Architecture of Association is a software architecture and series of interactive installations exploring mechanisms of associative thought. The system algorithmically generates and combines fragments of video, text, and sound in real-time via a cluster of networked computers and databases.",
  "longtitle": "Architecture of Association",
  "image": "img/aoa_l.jpg",
  "longdesc": "The Architecture of Association is a software architecture and series of interactive installations exploring mechanisms of associative thought. Drawing on research from a range of disciplines (psychology, linguistics, cognitive & computer science, etc.) the software explores large multi-media databases to 'discover' unexpected linkages between disparate items. An initial version opened in 2008 at the MIS Museum in Sao Paulo, with a full-scale premiere in 2009 at the Grand Palais in Paris."
}, {
  "shorttitle": "AdLiPo",
  "thumb": "img/adlipo_s.jpg",
  "shortdesc": "AdLiPo replaces advertisements with generated language art that questions the very nature of advertising. Leveraging the ad-detection techniques of popular ad-blockers, AdLiPo not only blocks ads, but replaces them with calls to Javascript code that fills the advertising regions of pages with text created in real-time.",
  "longtitle": "AdLiPo",
  "image": "img/adlipo_l.jpg",
  "longdesc": "AdLiPo replaces advertisements with generated language art that questions the very nature of advertising. Leveraging the ad-detection techniques of popular ad-blockers, AdLiPo not only blocks ads, but replaces them with calls to Javascript code that fills the advertising regions of pages with text created in real-time. AdLiPo doesn't replace every ad, but instead makes careful critical selections based on the content of the page."
}, {
  "shorttitle": "ChinaEye",
  "thumb": "img/chinaeye_s.jpg",
  "shortdesc": "ChinaEye allows users to experience the web as if living in China. ChinaEye hides all content on sites that are blocked in China. It does this via real-time lookup on a number of proxy sites in China. If the page is blocked in one or more of these locations, the page appears with content obscured.",
  "longtitle": "ChinaEye",
  "image": "img/chinaeye_l.png",
  "longdesc": "ChinaEye allows users to experience the web as if living in China. ChinaEye hides all content on sites that are blocked in China. It does this via real-time lookup on a number of proxy sites in China (Beijing, Shenzen, Mongolia, HeilongJiang, Yunnan, etc). If the page is blocked in one or more of these locations, the page appears with content obscured. Similarly, when searching, if a particular search term is censored, then the search results will be obscured as well."
}, {
  "shorttitle": "Redacto",
  "thumb": "img/redacto_s.png",
  "shortdesc": "Redacto redacts all the information on the Internet, just like your favorite oppressive regime. By simply adjusting a few CSS properties, all the distracting text and images on your favorite website are removed.",
  "longtitle": "Redacto",
  "image": "img/redacto_l.png",
  "longdesc": "Redacto redacts all the information on the Internet, just like your favorite oppressive regime. By simply adjusting a few CSS properties, all the distracting text and images on your favorite website are removed. <br><br />To temporarily restore the normal appearance of a page, click the 'disable' button in the Redacto toolbar. To restore all pages, simply disable the extension in the extension manager."
}]
