[{
  "section": "Journal Articles",
  "items": [
    {
      "year": 2020,
      "detail": "&ldquo;Dialogic: A Toolkit for Generative Interactive Dialog.&rdquo; Howe, Daniel C. Forthcoming in <em>Proceedings of Foundations of Digital Games</em>  (FDG) 2020, Association for Computing Machinery (ACM), New York, USA"
    },
    {
      "year": 2019,
      "detail": "&ldquo;A Critique of Surprise in Generative Art.&rdquo; Soderman, Braxton and Daniel C. Howe. In <em>Algorithmic and Generative Art,</em> edited by Aceti, Lanfranco, Kris Paulsen, and Meredith Hoy. Leonardo Electronic Almanac. Volume 22, Issue 4. March 15, 2019, Cambridge: MIT Press.",
      "link": "https://www.leoalmanac.org/a-critique-of-surprise-in-generative-art-braxton-soderman-daniel-c-howe/"
    },

    {
      "year": 2018,
      "detail": "&ldquo;Advertising Positions: Data Portraiture as Aesthetic Critique.&rdquo; Howe, Daniel C. et al. In <em>Leonardo</em>, Volume 51, Issue 4, August 2018. p.413-418. Cambridge: MIT Press. Originally published in ACM Trans. Graphics.",
      "link": "pdfs/AdvertisingPositions2018.pdf"
    },

    {
      "year": 2018,
      "detail": "&ldquo;You Have Pressure, I Have Pressure: Hacking, Art & Activism in Hong Kong.&rdquo; Howe, Daniel C. Chapter 3, in <em>The Field Guide to Hacking.</em> 2018. Hong Kong: Dim Sum Press.",
      "link": "pdfs/YouHavePressure.pdf"
    },

    {
      "year": 2015,
      "detail": "&ldquo;Surveillance Countermeasures: Expressive Privacy via Obfuscation.&rdquo; Howe, Daniel C.  In <em>A Peer&ndash;reviewed Journal About (APRJA).</em> Christian Ulrik Andersen and Geoff Cox (eds.) Vol. 4, Issue 1. Aarhus: Digital Aesthetics Research Center, Aarhus University, Berlin",
      "link": "pdfs/expressiveprivacy.pdf"
    },

    {
      "year": 2011,
      "detail": "&ldquo;The Readers Project: Procedural Agents and Literary Vectors.&rdquo; Howe, Daniel C. and Cayley, J. In <em>Leonardo.</em> Aug 2011, Vol. 44, No. 4, MIT Press, Cambridge, MA, p317&ndash;324.",
      "link": "pdfs/LEON4404_pp317-324.pdf"
    },

    {
      "year": 2009,
      "detail": "&ldquo;The Aesthetics of Generative Literature: Lessons from an Electronic Writing Workshop.&rdquo; Howe, Daniel C. and Soderman, A. B.  In <em>Hyperrhiz: New Media Cultures, Visionary Landscapes</em>, Vol. 6. Fall",
      "link": "http://dx.doi.org/10.20415/hyp/006.e04"
    },

    {
      "year": 2000,
      "detail": "&ldquo;Trust Online.&rdquo; Friedman, B., Khan P. H. Jr. and Howe, D. C. In <em>Communications of the ACM</em>, v.43 n.12. New York: Association for Computing Machinery,  p.34&ndash;40.",
      "link": ""
    }
  ]
}, {
  "section": "Book Chapters",
  "items": [
    {
      "year": 2019,
      "detail": "&ldquo;A Statement by The Readers Project concerning contemporary literary practice, digital mediation, intellectual property, and associated moral rights.&rdquo; Cayley, J. and Howe, Daniel C., in <em>Whose Book is it Anyway?: A View From Elsewhere on Publishing, Copyright and Creativity</em>, Jeffries, J, and Kember, S. (eds.) Open Book Publishers. DOI: 10.11647/OBP.0159.01",
      "link": "pdfs/StatementByTheReadersProject2019.pdf"
    },
    {
      "year": 2015,
      "detail": "&ldquo;Protecting Sensitive Communication with Defensive Technology.&rdquo; Howe, Daniel C. Chapter 25, in <em>Boycott Classes, Continue Learning - A Review of the Theories and Thoughts Prior to the Umbrella Movement.</em> Hong Kong: Step Forward Press, p239-251.",
      "link": ""
    },
    {
      "year": 2008,
      "detail": "&ldquo;TrackMeNot:  Resisting Surveillance in Web Search.&rdquo; Howe, Daniel C. and Nissenbaum, H.  Chapter 23, in <em>Lessons from the Identity Trail: Anonymity, Privacy and Identity in a Networked Society</em>. Ian Kerr, Carole Lucock and Valerie Steeves (eds.) Oxford:  Oxford University Press, p417&ndash;436.",
      "link": "pdfs/trackmenot2009.pdf"
    },
    {
      "year": 2008,
      "detail": "&ldquo;Values in Design: Theory and Practice.&rdquo; Flanagan, M., Howe, D., & Nissenbaum, H. Embodying Values in Technology: Theory and Practice. In <em>Information Technology and Moral Philosophy</em> (Cambridge Studies in Philosophy and Public Policy, pp. 322-353), J. Van den Hoven & J. Weckert (Eds.). Cambridge: Cambridge University Press. DOI: 10.1017/CBO9780511498725.017",
      "link": "pdfs/embodying_values.pdf"
    },
    {
      "year": 2007,
      "detail": "&ldquo;New Design Methods for Activist Gaming.&rdquo; Flanagan, M., Howe, D. C. and Nissenbaum, H. Chapter 20, in <em>Worlds in Play: International Perspectives on Digital Games Research (New Literacies and Digital Epistemologies)</em>, S. de Castell and J. Jensen (eds.) Peter Lang, p241&ndash;248.",
      "link": ""
    },

    {
      "year": 2006,
      "detail": "&ldquo;Informed Consent in the Mozilla Browser:  Implementing Value&ndash;Sensitive Design.&rdquo; Friedman, B., Howe, D. C. and Felten, E. W. Chapter 9, in <em>Internet Security: Hacking, CounterHacking, and Society, K. E. Himma (editor).  Mass: Jones and Bartlett Publishers, p153&ndash;170.",
      "link": "pdfs/InformedConsent.pdf"
    }
  ]
}, {
  "section": "Conference Proceedings",
  "items": [{
      "year": 2017,
      "detail": "&ldquo;Engineering Privacy and Protest: a Case Study of AdNauseam.&rdquo; Howe, Daniel C. and Nissenbaum, H.  Chapter 23, in <em>Proceedings of the IEEE International Workshop on Privacy Engineering,</em> San Jose, California, USA",
      "link": "pdfs/adnauseam.pdf"
    },
    {
      "year": 2013,
      "detail": "&ldquo;Reading, Writing, Resisting: Literary Appropriation in the Readers Project.&rdquo; Howe, Daniel C. and Cayley, J. In <em>Proceedings of the 19th International Symposium of Electronic Art.</em> Cleland, Fisher, and Harley, Editors. ISEA International, the Australian Network for Art &amp; Technology and the University of Sydney.",
      "link": "pdfs/the_readers_project-reading_writing_resisting-howe_cayley.pdf"
    },

    {
      "year": 2012,
      "detail": "&ldquo;In Common Tongues.&rdquo; Cayley, J. and Howe, Daniel C. In <em>Remediating the Social.</em> Bergen, Norway, University of Bergen, Department of Linguistic, Literary and Aesthetic Studies, p46&ndash;47.",
      "link": "pdfs/remediating_the_social.pdf"
    },

    {
      "year": 2009,
      "detail": "&ldquo;RiTa: creativity support for computational literature.&rdquo; In <em>Proceedings of the seventh ACM conference on Creativity and cognition (C&amp;C '09).</em> ACM, New York, NY, USA, p205-210.",
      "link": "pdfs/rita2009.pdf"
    },

    {
      "year": 2005,
      "detail": "&ldquo;Values at Play:  Design Tradeoffs in Socially&ndash;Oriented Game Design.&rdquo; Flanagan, M, Howe, D. C., and Nissenbaum, H. In Proceedings of the CHI 2005 Conference on Human Factors in Computing Systems.</em> CHI 2005, 2&ndash;7 April, Portland, Oregon. New York: ACM Press, p751-760.",
      "link": "pdfs/values_at_play.pdf"
    },
    {
      "year": 2005,
      "detail": "&ldquo;New Design Methods for Activist Gaming.&rdquo; Flanagan, M., Howe, D. C. and Nissenbaum, H. Chapter 20, in <em>Proceedings of the Digital Games Research Association (DIGRA)</em>, June 16-20, Vancouver CA.",
      "link": "pdfs/NewDesignMethodsActivistGaming.pdf"
    },
    {
      "year": 2002,
      "detail": "&ldquo;Informed Consent in the Mozilla Browser:  Implementing Value&ndash;Sensitive Design.&rdquo; Friedman, B., Howe, D. C.,  and Felten, E. W. In <em>Proceedings of 35th Annual Hawaii International Conference on System Sciences</em>, Jan 2002. (Awarded Best Paper of Organizational Systems track). Abstract. IEEE Computer Society Washington, DC, USA,  p247.",
      "link": "pdfs/InformedConsent.pdf"
    },
    {
      "year": 2002,
      "detail": "&ldquo;Users' Conceptions of Web Security:  A Comparative Study.&rdquo; Friedman, B., Hurley, D., Howe, D. C., Felten, E. W. and H. Nissenbaum. In <em>Extended Abstracts of the Conf. on Human Factors in Computing Systems, CHI 2002.</em> New York: ACM Press, p614&ndash;615.",
      "link": ""
    },

    {
      "year": 2002,
      "detail": "&ldquo;Users' Conceptions of Risks and Harms on the Web:  A Comparative Study.&rdquo; Friedman, B., Nissenbaum, H. Hurley, D., Howe, D. C. and Felten, E. W. In <em>Extended Abstracts of CHI 2002.</em> New York, NY: ACM Press. p746-747&nbsp;",
      "link": ""
    }
  ]
}, {
  "section": "Other Publications",
  "items": [
    {
      "year": 2017,
      "detail": "&ldquo;Obfuscation Workshop Report.&rdquo; Brunton, F., Nissenbaum, H., Howe, D, et al. <em>Report for the National Science Foundation</em>, 2017-09-01",
      "hidden": true,
      "link": ""
    },
    {
      "year": 2016,
      "detail": "&ldquo;The Readers Project.&rdquo; Howe, Daniel C. and Cayley, J. In <em>Electronic Literature Collection Vol. III.</em> Cambridge, Massachusetts: Electronic Literature Organization.",
      "link": "http://collection.eliterature.org/3/work.html?work=the-readers-project"
    },

    {
      "year": 2015,
      "detail": "&ldquo;Browser Hacks for DIY Privacy.&rdquo; Howe, Daniel C. In <em>The Datafied Research Reader</em>, Cox, G., and Andersen, C.U., eds.: transmediale/darc, Aarhus University.",
      "link": ""
    },

    {
      "year": 2014,
      "detail": "&ldquo;AdLiPo.&rdquo; Howe, Daniel C. In <em>Drunken Boat.</em> DB20, Winter 2014.",
      "link": ""
    },

    {
      "year": 2014,
      "detail": "&ldquo;Gesture / Language / Mirror: A Research Project and Installation Series Exploring the Mirror Neuron and Mirror Therapy.&rdquo; Howe, Daniel C. and Gruber, D. In&nbsp;<em>The New Everyday</em>, Hoelzl, I. editor: Vol. &lsquo;the Operative Image&rsquo;,  p3&ndash;6.",
      "link": ""
    },

    {
      "year": 2012,
      "detail": "<em>How It Is, in Common Tongues</em>. Cayley, J. and Howe, Daniel C. Limited Edition Monograph, 297 pp., NLLF Press.  ISBN&ndash;13: 978&ndash;0948454301",
      "link": "pdfs/hiiict.pdf"
    },

    {
      "year": 2012,
      "detail": "&ldquo;I Will Not Make Any More Boring [Art Fair] Art: John Baldessari &amp; the fabric of the everyday.&rdquo; Daniel C. Howe, In <em>Pipeline</em>, Hong Kong, Issue No. 30, p119&ndash;120.",
      "link": ""
    },

    {
      "year": 2011,
      "detail": "&ldquo;Roulette.&rdquo; Howe, Daniel C. and Molina, B. In Electronic Literature Collection Vol. II.</em> Cambridge, Massachusetts: Electronic Literature Organization.",
      "link": "http://collection.eliterature.org/2/works/howe_roulette.html"
    },

    {
      "year": "2008 ",
      "detail": "&ldquo;Roulette.&rdquo; Howe, Daniel C. and Molina, B. In <em>New River Journal</em>, Virginia Tech's Center for Digital Discourse and Culture.",
      "link": ""
    },

    {
      "year": 2006,
      "detail": "&ldquo;Open&ndash;Ended.&rdquo; Howe, Daniel C. and Karpinska, A. In <em>Electronic Literature Collection Vol. I.</em> College Park, Maryland: Electronic Literature Organization.",
      "link": ""
    },

    {
      "year": 2006,
      "detail": "&ldquo;Open.Ended.&rdquo; Karpinska, A. and Howe, Daniel C. In <em>Leonardo Electronic Almanac. New Media Poetry and Poetics Special Issue</em>. Vol. 14, No. 5&ndash;6.",
      "link": ""
    },

    {
      "year": 2004,
      "detail": "&ldquo;Phantom Access Agent: a Client&ndash;Side Approach to Personal Information Control.&rdquo;Zhao, X., Howe, D. C., Mazi&egrave;res, D. and Nissenbaum, H. <em>New York University Report</em>. Manuscript/Software.",
      "link": ""
    }
  ]
}]
